Notes/daily/2021-11-28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-11-28</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-11-28</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-12-12.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc28c085">A short note on what I did today</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc28c085" class="outline-2">
<h2 id="orgc28c085">A short note on what I did today</h2>
<div class="outline-text-2" id="text-orgc28c085">
<p>
It's been a while since I did anything on my EPQ, and I have a time scheduled to work on the EPQ, so I worked on the EPQ today. I have a few more bits and pieces to research before I get the first leg of the project fully underway, so I decided to do research on <a href="../20211128100407-language_comparisons.html#ID-3f64a1d4-b52d-4b7f-9a25-d2ebf1587810">what langauge to use</a>. I decided to evaluate each of the languages on 4 general areas: popularity, experience, availablility of tools and libraries, and benchmarks of each language. After evaluating I would look at each of the lanaguages and decide which one to use based on the information I've gathered.
</p>

<p>
Insofar as I completed the research today python looks like a really strong choice, although it faltered a little on my future plans and I expect it to completely fail on the 'benchmarks' section of the research (I've run python and javascript benchmarks before; python is <i>not</i> fast).
</p>

<p>
Tomorrow during my would-be-tutorial period I plan to complete the tool availability section and write some benchmarks. This will also give me a good chance to get better acquainted with some simpler 'go' concepts, as I have very little experience apart from messing around with example code. After I've done this research I need to evaluate it for accuracy, and then pick the language I'll be working with for the next year in the EPQ, and for maintainance for the forseeable future. No pressure then&#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
